/* =============================================================================
题目内容：
=============================================================================*/
这题啥玩意。
感觉像是上面的合并Entry的题目啊。
/* =============================================================================
code
=============================================================================*/




/* =============================================================================
地里面经总结
=============================================================================*/
<A> 上机，处理LOG的题目，注意看清楚题目别乱写看清楚题目之后再写他的DOCU讲的很模糊
<B> 处理log，每条log中包含timestamp、key、操作类型（click/search）等信息，然后定义了session，让你输出所有session的信息。
    test cases分为small,medium,large几种，我的large的内存爆了…
<C> 下午上机1个半小时写个函数处理log信息，相关输入输出接口都已写好，直接用就行，用到的唯一的数据结构就是HashMap，
    有test case供测试，分为tiny，small，medium，large四个test case，其实我觉得函数大概30分钟左右一般人就能写完了，
    也不会有什么错，我就是这种情况，可就是跑large case的时候heap memory会爆掉，然后优化了一个小时也还是没跑过去。。。
    不过事后看起来这个应该不重要，起码不影响offer
<D> 上机题是用它提供的一些基本工具处理一个log file，
    这个file每一行都是(user_id, timestamp,action_type）。
    要求根据userid和timestamp划分session，划分规则是一个session里面相邻的两个操作间隔不超过10分钟。
    随后输出整理好的sessionlog和统计数据。我把统计数据搞出来了，但是没来的及输出。